TheScientist101/astra/controller/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"

# Options for mirf (nRF24) component
CONFIG_MISO_GPIO=10
CONFIG_SCLK_GPIO=6
CONFIG_MOSI_GPIO=7
CONFIG_CE_GPIO=4
CONFIG_CSN_GPIO=5
